# CHIPOTLE SALES

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
chipotle=pd.read_csv('C:/Users/Dell E5470/Desktop/EDA practice projects/raw.githubusercontent.com_justmarkham_DAT8_master_data_chipotle.tsv.txt',sep='\t')
chipotle.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
chipotle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [5]:
chipotle.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [17]:
null_choice=chipotle[chipotle.isna().any(axis=1)]
null_choice.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
6,3,1,Side of Chips,NaN,$1.69
10,5,1,Chips and Guacamole,NaN,$4.45
14,7,1,Chips and Guacamole,NaN,$4.45

In [6]:
chipotle.isna().sum() ## the choice description column has 1246 missing values

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64

In [18]:
chipotle[chipotle['item_name'].str.contains('Chips')]

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
6,3,1,Side of Chips,NaN,$1.69
10,5,1,Chips and Guacamole,NaN,$4.45
14,7,1,Chips and Guacamole,NaN,$4.45
...,...,...,...,...,...
4596,1826,1,Chips and Guacamole,NaN,$4.45
4600,1827,1,Chips and Guacamole,NaN,$4.45
4605,1828,1,Chips and Guacamole,NaN,$4.45
4613,1831,1,Chips,NaN,$2.15
4616,1832,1,Chips and Guacamole,NaN,$4.45

In [20]:
chipotle[chipotle['item_name'].str.contains('Water')]

      order_id  quantity      item_name choice_description item_price
34          17         1  Bottled Water                NaN     $1.09
87          38         1  Bottled Water                NaN     $1.09
318        138         1  Bottled Water                NaN     $1.09
329        143         1  Bottled Water                NaN     $1.50
376        163         1  Bottled Water                NaN     $1.50
...        ...       ...            ...                ...        ...
4568      1817         1  Bottled Water                NaN     $1.50
4570      1817         1  Bottled Water                NaN     $1.50
4582      1822         2  Bottled Water                NaN     $3.00
4598      1826         1  Bottled Water                NaN     $1.50
4614      1831         1  Bottled Water                NaN     $1.50

[162 rows x 5 columns]

item names containing the name water and chips contain null values in their chpice description

In [21]:
# let us fill the null values
chipotle["choice_description"].fillna("No description", inplace = True)

In [22]:
# let us confirm that all the nulls have been filled
chipotle.isna().sum()

order_id              0
quantity              0
item_name             0
choice_description    0
item_price            0
dtype: int64

In [ ]:
## lets do some data analysis now

In [ ]:
### 1. which was the most ordered item

In [47]:
## there are two approaches to this method, the first one id to use a pivot table
chipotle_ordered_items=chipotle.pivot_table(index='item_name',aggfunc='sum',values='quantity').sort_values(by='quantity',ascending=False)
chipotle_ordered_items.head(1)

              quantity
item_name
Chicken Bowl       761

In [ ]:
# the second method is to use the groupby function

In [40]:
grouped = chipotle.groupby('item_name')

In [51]:
item_quantities = grouped['quantity'].sum()
item_quantities.sort_values(ascending=False).head(5)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

In [ ]:
# turn the item price into a float-

In [55]:
## lets us first drop the dollar sign in the item _price
chipotle['item_price'] = chipotle['item_price'].replace('\$|,', '', regex=True)

chipotle['item_price']=pd.to_numeric(chipotle['item_price'])


## you can also use the l.strip method to first srip the dollar sign then convert the sting to numeric
#chipotle['item_price'] = chipotle['item_price'].str.lstrip('$').astype(float)

In [ ]:
# how much was the total revenue

In [61]:
chipotle['Revenue']=chipotle['quantity']* chipotle['item_price']
chipotle['Revenue'].sum()

39237.02

In [ ]:
#How many orders were made in the period?

In [62]:
chipotle['quantity'].sum()

4972

In [ ]:
# What is the average revenue amount per order?

In [64]:
Avg_revenue=chipotle['Revenue'].sum()/chipotle['quantity'].sum()
Avg_revenue

7.8915969428801285

In [ ]:
## How many different items are sold?

In [65]:
chipotle['item_name'].nunique()

50